[
    {
        "text": "Every action you take is a vote for the type of person you wish to become.",
        "author": "James Clear"
    },
    {
        "text": "You do not rise to the level of your goals. You fall to the level of your systems.",
        "author": "James Clear"
    },
    {
        "text": "Habits are the compound interest of self-improvement.",
        "author": "James Clear"
    },
    {
        "text": "The most effective way to change your habits is to focus not on what you want to achieve, but on who you wish to become.",
        "author": "James Clear"
    },
    {
        "text": "Success is the product of daily habits—not once-in-a-lifetime transformations.",
        "author": "James Clear"
    },
    {
        "text": "Be the designer of your world and not merely the consumer of it.",
        "author": "James Clear"
    },
    {
        "text": "When you fall in love with the process rather than the product, you don’t have to wait to give yourself permission to be happy.",
        "author": "James Clear"
    },
    {
        "text": "Goals are good for setting a direction, but systems are best for making progress.",
        "author": "James Clear"
    },
    {
        "text": "Standardize before you optimize. You can’t improve a habit that doesn’t exist.",
        "author": "James Clear"
    },
    {
        "text": "The only way to become excellent is to be endlessly fascinated by doing the same thing over and over. You have to fall in love with boredom.",
        "author": "James Clear"
    },
    {
        "text": "You don't have to be the victim of your environment. You can also be the architect of it.",
        "author": "James Clear"
    },
    {
        "text": "A slight change in your daily habits can guide your life to a very different destination.",
        "author": "James Clear"
    },
    {
        "text": "If you want better results, then forget about setting goals. Focus on your system instead.",
        "author": "James Clear"
    },
    {
        "text": "The ultimate form of intrinsic motivation is when a habit becomes part of your identity.",
        "author": "James Clear"
    },
    {
        "text": "It's not about what you have. It's about who you become.",
        "author": "James Clear"
    }
]