{
  "source": "Atomic Habits by James Clear",
  "total_quotes": 622,
  "categories": {
    "identity": {
      "count": 80,
      "quotes": [
        "It is only when looking back two, five, or perhaps ten years later that the value of good habits and the cost of bad ones becomes strikingly apparent.",
        "W 2 How Your Habits Shape Your Identity (and Vice Versa) HY IS IT so easy to repeat bad habits and so hard to form good ones?",
        "Habits like exercise, meditation, journaling, and cooking are reasonable for a day or two and then become a hassle.",
        "The third and deepest layer is changing your identity.",
        "Identity is about what you believe.",
        "The alternative is to build identity-based habits.",
        "With this approach, we start by focusing on who we wish to become.",
        "With identity-based habits, the focus is on who you wish to become.",
        "I’m not a smoker.” It’s a small difference, but this statement signals a shift in identity.",
        "Most people don’t even consider identity change when they set out to improve.",
        "They never shift the way they look at themselves, and they don’t realize that their old identity can sabotage their new plans for change.",
        "That’s not the identity of the system.",
        "There are a set of beliefs and assumptions that shape the system, an identity behind the habits.",
        "You may want more money, but if your identity is someone who consumes rather than creates, then you’ll continue to be pulled toward spending rather than earning.",
        "You have a new goal and a new plan, but you haven’t changed who you are.",
        "And it’s because I now take pride in properly caring for them.” The ultimate form of intrinsic motivation is when a habit becomes part of your identity.",
        "The more pride you have in a particular aspect of your identity, the more motivated you will be to maintain the habits associated with it.",
        "True behavior change is identity change.",
        "You might start a habit because of motivation, but the only reason you’ll stick with one is that it becomes part of your identity.",
        "Improvements are only temporary until they become part of who you are.",
        "The goal is not to read a book, the goal is to become a reader.",
        "The goal is not to run a marathon, the goal is to become a runner.",
        "The goal is not to learn an instrument, the goal is to become a musician.",
        "Your behaviors are usually a reflection of your identity.",
        "Similarly, the person who incorporates exercise into their identity doesn’t have to convince themselves to train.",
        "When working for you, identity change can be a powerful force for self-improvement.",
        "When working against you, though, identity change can be a curse.",
        "Once you have adopted an identity, it can be easy to let your allegiance to it impact your ability to change.",
        "Many people walk through life in a cognitive slumber, blindly following the norms attached to their identity.",
        "The more deeply a thought or action is tied to your identity, the more difficult it is to change it.",
        "The biggest barrier to positive change at any level—individual, team, society—is identity conflict.",
        "Good habits can make rational sense, but if they conflict with your identity, you will fail to put them into action.",
        "This is why you can’t get too attached to one version of your identity.",
        "Becoming the best version of yourself requires you to continuously edit your beliefs, and to upgrade and expand your identity.",
        "How, exactly, is your identity formed?",
        "And how can you emphasize new aspects of your identity that serve you and gradually erase the pieces that hinder you?",
        "THE TWO-STEP PROCESS TO CHANGING YOUR IDENTITY Your identity emerges out of your habits.",
        "* More precisely, your habits are how you embody your identity.",
        "When you make your bed each day, you embody the identity of an organized person.",
        "When you write each day, you embody the identity of a creative person.",
        "When you train each day, you embody the identity of an athletic person.",
        "The more you repeat a behavior, the more you reinforce the identity associated with that behavior.",
        "Your identity is literally your “repeated beingness.” Whatever your identity is right now, you only believe it because you have proof of it.",
        "Of course, your habits are not the only actions that influence your identity, but by virtue of their frequency they are usually the most important ones.",
        "Each habit is like a suggestion: “Hey, maybe this is who I am.” If you finish a book, then perhaps you are the type of person who likes reading.",
        "If you practice playing the guitar, perhaps you are the type of person who likes music.",
        "Every action you take is a vote for the type of person you wish to become.",
        "No single instance will transform your beliefs, but as the votes build up, so does the evidence of your new identity.",
        "Small habits can make a meaningful difference by providing evidence of a new identity.",
        "Putting this all together, you can see that habits are the path to changing your identity.",
        "The most practical way to change who you are is to change what you do.",
        "Every time you choose to perform a bad habit, it’s a vote for that identity.",
        "Start there and work backward from the results you want to the type of person who could get those results.",
        "Who is the type of person that could run a successful start-up?",
        "Now your focus shifts from writing a book (outcome-based) to being the type of person who is consistent and reliable (identity-based).",
        "The concept of identity-based habits is our first introduction to another key theme in this book: feedback loops.",
        "Your habits shape your identity, and your identity shapes your habits.",
        "The focus should always be on becoming that type of person, not getting a particular outcome.",
        "THE REAL REASON HABITS MATTER Identity change is the North Star of habit change.",
        "Your identity is not set in stone.",
        "You can choose the identity you want to reinforce today with the habits you choose today.",
        "Ultimately, your habits matter because they help you become the type of person you wish to be.",
        "Quite literally, you become your habits.",
        "The most effective way to change your habits is to focus not on what you want to achieve, but on who you wish to become.",
        "Your identity emerges out of your habits.",
        "Every action is a vote for the type of person you wish to become.",
        "WHY YOUR BRAIN BUILDS HABITS A habit is a behavior that has been repeated enough times to become automatic.",
        "If a behavior is insufficient in any of the four stages, it will not become a habit.",
        "That’s the origin of the Habits Scorecard, which is a simple exercise you can use to become more aware of your behavior.",
        "If you’re still having trouble determining how to rate a particular habit, here is a question I like to use: “Does this behavior help me become the type of person I wish to be?",
        "Habits that conflict with your desired identity are usually bad.",
        "Once our habits become automatic, we stop paying attention to what we are doing.",
        "The Habits Scorecard is a simple exercise you can use to become more aware of your behavior.",
        "Each action becomes a cue that triggers the next behavior.",
        "If you can manage to stick with this strategy, each context will become associated with a particular habit and mode of thought.",
        "Gradually, your habits become associated not with a single trigger but with the entire context surrounding the behavior.",
        "Write down your current habits to become aware of them.",
        "The more attractive an opportunity is, the more likely it is to become habit-forming.",
        "The reward gets associated with the cue, and the habit of turning on the television becomes more attractive.",
        "He claimed that with deliberate practice and the development of good habits, a child could become a genius in any field."
      ]
    },
    "improvement": {
      "count": 51,
      "quotes": [
        "But with better habits, anything is possible.",
        "The only way I made progress—the only choice I had—was to start small.",
        "I was increasingly asked to speak at top companies about the science of habit formation, behavior change, and continuous improvement.",
        "Why do small improvements accumulate into such remarkable results, and how can you replicate this approach in your own life?",
        "The difference a tiny improvement can make over time is astounding.",
        "Here’s how the math works out: if you can get 1 percent better each day for one year, you’ll end up thirty-seven times better by the time you’re done.",
        "Habits are the compound interest of self-improvement.",
        "The same way that money multiplies through compound interest, the effects of your habits multiply as you repeat them.",
        "YOUR HABITS CAN COMPOUND FOR YOU OR AGAINST YOU Positive Compounding Productivity compounds.",
        "It builds up, like compound interest.” Relationships compound.",
        "You expect to make progress in a linear fashion and it’s frustrating how ineffective changes can seem during the first days, weeks, and even months.",
        "It’s a hallmark of any compounding process: the most powerful outcomes are delayed.",
        "If you find yourself struggling to build a good habit or break a bad one, it is not because you have lost your ability to improve.",
        "But you know that it’s the work you did long ago—when it seemed that you weren’t making any progress—that makes the jump today possible.",
        "What is it that causes some people to slide into unwanted habits and enables others to enjoy the compounding effects of good ones?",
        "The only way to actually win is to get better each day.",
        "If you want better results, then forget about setting goals.",
        "Goals are good for setting a direction, but systems are best for making progress.",
        "It was only when they implemented a system of continuous small improvements that they achieved a different outcome.",
        "That’s the counterintuitive thing about improvement.",
        "Problem #4: Goals are at odds with long-term progress.",
        "It is about the cycle of endless refinement and continuous improvement.",
        "Ultimately, it is your commitment to the process that will determine your progress .",
        "Each one is a fundamental unit that contributes to your overall improvement.",
        "Getting 1 percent better every day counts for a lot in the long-run.",
        "The most powerful outcomes of any compounding process are delayed.",
        "And yet it is likely that this time next year you’ll be doing the same thing rather than something better.",
        "This level is concerned with changing your habits and systems: implementing a new routine at the gym, decluttering your desk for better workflow, developing a meditation practice.",
        "When it comes to building habits that last—when it comes to building a system of 1 percent improvements—the problem is not that one level is “better” or “worse” than another.",
        "You may want better health, but if you continue to prioritize comfort over accomplishment, you’ll be drawn to relaxing rather than training.",
        "That’s the paradox of making small improvements.",
        "Building better habits isn’t about littering your day with life hacks.",
        "The real reason habits matter is not because they can get you better results (although they can do that), but because they can change your beliefs about yourself.",
        "The primary reason the brain remembers the past is to better predict what will work in the future.",
        "* Breaking it down into these fundamental parts can help us understand what a habit is, how it works, and how to improve it.",
        "Getting in shape improves your health and your dating prospects.",
        "The Four Laws of Behavior Change are a simple set of rules we can use to build better habits.",
        "If a habit remains mindless, you can’t expect to improve it.",
        "Some people spend their entire lives waiting for the time to be right to make an improvement.",
        "Being specific about what you want and how you will achieve it helps you say no to things that derail progress, distract your attention, and pull you off course.",
        "Habits like “read more” or “eat better” are worthy causes, but these goals do not provide instruction on how and when to act.",
        "The more tightly bound your new habit is to a specific cue, the better the odds are that you will notice when the time comes to act.",
        "She believed she could improve the eating habits of thousands of hospital staff and visitors without changing their willpower or motivation in the slightest way.",
        "The stickers improved their aim and significantly reduced “spillage” around the urinals.",
        "Making a better decision is easy and natural when the cues for good habits are right in front of you.",
        "Instead, “ disciplined” people are better at structuring their lives in a way that does not require heroic willpower and self- control.",
        "Instead of summoning a new dose of willpower whenever you want to do the right thing, your energy would be better spent optimizing your environment.",
        "This is one reason the anticipation of an experience can often feel better than the attainment of it.",
        "As a child, thinking about Christmas morning can be better than opening the gifts.",
        "Sofia, the middle child, did even better.",
        "One of the most effective things you can do to build better habits is to join a culture where your desired behavior is the normal behavior."
      ]
    },
    "consistency": {
      "count": 29,
      "quotes": [
        "A habit is a routine or behavior that is performed regularly—and, in many cases, automatically.",
        "As each semester passed, I accumulated small but consistent habits that ultimately led to results that were unimaginable to me when I started.",
        "This can be a difficult concept to appreciate in daily life.",
        "We make a few changes, but the results never seem to come quickly and so we slide back into our previous routines.",
        "* Similarly, a slight change in your daily habits can guide your life to a very different destination.",
        "Success is the product of daily habits—not once-in-a-lifetime transformations.",
        "Instead, a long series of microaggressions and daily aggravations slowly multiply until one event tips the scales and outrage spreads like wildfire.",
        "But as that decision is repeated, a habit sprouts and grows stronger.",
        "Bad habits repeat themselves again and again not because you don’t want to change, but because you have the wrong system for change.",
        "Few things can have a more powerful impact on your life than improving your daily habits.",
        "When you have repeated a story to yourself for years, it is easy to slide into these mental grooves and accept them as a fact.",
        "As you repeat these actions, however, the evidence accumulates and your self- image begins to change.",
        "Your habits are just a series of automatic solutions that solve the problems and stresses you face regularly.",
        "Doesn’t so much routine take away the vibrancy and spontaneity of life?” Hardly.",
        "Without all four, a behavior will not be repeated.",
        "To create your own, make a list of your daily habits.",
        "All habits serve you in some way —even the bad ones—which is why you repeat them.",
        "It adds weight to the action rather than letting yourself mindlessly slip into an old routine.",
        "This process can be repeated to chain numerous habits together, each one acting as the cue for the next.",
        "Your morning routine habit stack might look like this: 1 .",
        "You can also insert new behaviors into the middle of your current routines.",
        "When and where you choose to insert a habit into your daily routine can make a big difference.",
        "If you want to do a habit every day, but you stack it on top of a habit that only happens on Mondays, that’s not a good choice.",
        "Each location develops a connection to certain habits and routines.",
        "Go to a new place—a different coffee shop, a bench in the park, a corner of your room you seldom use—and create a new routine there.",
        "Take a break from the space where you do your daily work, which is also linked to your current thought patterns.",
        "To put it bluntly, I have never seen someone consistently stick to positive habits in a negative environment.",
        "Don’t forget to repeat this action next time.” Your brain has far more neural circuitry allocated for wanting rewards than for liking them.",
        "New habits seem achievable when you see others doing them every day."
      ]
    },
    "systems": {
      "count": 73,
      "quotes": [
        "Bamboo can barely be seen for the first five years as it builds extensive root systems underground before exploding ninety feet into the air within six weeks.",
        "Each one was a goal to be reached.",
        "I set goals for the grades I wanted to get in school, for the weights I wanted to lift in the gym, for the profits I wanted to earn in business.",
        "What’s the difference between systems and goals?",
        "Goals are about the results you want to achieve.",
        "Systems are about the processes that lead to those results.",
        "If you’re a coach, your goal might be to win a championship.",
        "Your system is the way you recruit players, manage your assistant coaches, and conduct practice.",
        "If you’re an entrepreneur, your goal might be to build a million- dollar business.",
        "Your system is how you test product ideas, hire employees, and run marketing campaigns.",
        "If you’re a musician, your goal might be to play a new piece.",
        "Your system is how often you practice, how you break down and tackle difficult measures, and your method for receiving feedback from your instructor.",
        "Now for the interesting question: If you completely ignored your goals and focused only on your system, would you still succeed?",
        "The goal in any sport is to finish with the best score, but it would be ridiculous to spend the whole game staring at the scoreboard.",
        "A handful of problems arise when you spend too much time thinking about your goals and not enough time designing your systems.",
        "Problem #1: Winners and losers have the same goals.",
        "Goal setting suffers from a serious case of survivorship bias.",
        "And if successful and unsuccessful people share the same goals, then the goal cannot be what differentiates the winners from the losers.",
        "It wasn’t the goal of winning the Tour de France that propelled the British cyclists to the top of the sport.",
        "The goal had always been there.",
        "Problem #2: Achieving a goal is only a momentary change.",
        "Imagine you have a messy room and you set a goal to clean it.",
        "You’re left chasing the same outcome because you never changed the system behind it.",
        "Achieving a goal only changes your life for the moment .",
        "What we really need to change are the systems that cause those results.",
        "Problem #3: Goals restrict your happiness.",
        "Furthermore, goals create an “either-or” conflict: either you achieve your goal and are successful or you fail and you are a disappointment.",
        "A systems-first mentality provides the antidote.",
        "You can be satisfied anytime your system is running.",
        "And a system can be successful in many different forms, not just the one you first envision.",
        "Finally, a goal-oriented mind-set can create a “yo-yo” effect.",
        "When all of your hard work is focused on a particular goal, what is left to push you forward after you achieve it?",
        "This is why many people find themselves reverting to their old habits after accomplishing a goal.",
        "The purpose of setting goals is to win the game.",
        "The purpose of building systems is to continue playing the game.",
        "True long-term thinking is goal-less thinking.",
        "A SYSTEM OF ATOMIC HABITS If you’re having trouble changing your habits, the problem isn’t you.",
        "You do not rise to the level of your goals.",
        "You fall to the level of your systems.",
        "Focusing on the overall system, rather than a single goal, is one of the core themes of this book.",
        "They are little habits that are part of a larger system.",
        "An atomic habit is a little habit that is part of a larger system.",
        "Most of the goals you set are associated with this level of change.",
        "Many people begin the process of changing their habits by focusing on what they want to achieve.",
        "Behind every system of actions are a system of beliefs.",
        "The system of a democracy is founded on beliefs like freedom, majority rule, and social equality.",
        "The system of a dictatorship has a very different set of beliefs like absolute authority and strict obedience.",
        "Your goal is simply to win the majority of the time.",
        "It is a simple two-step process: 1 .",
        "The process of habit formation begins with trial and error.",
        "Your brain skips the process of trial and error and creates a mental rule: if this, then that.",
        "THE SCIENCE OF HOW HABITS WORK The process of building a habit can be divided into four simple steps: cue, craving, response, and reward.",
        "Rewards are the end goal of every habit.",
        "As you go about your life, your sensory nervous system is continuously monitoring which actions satisfy your desires and deliver pleasure.",
        "But before we do that, we need to transform these four steps into a practical framework that we can use to design good habits and eliminate bad ones.",
        "I refer to this framework as the Four Laws of Behavior Change , and it provides a simple set of rules for creating good habits and breaking bad ones.",
        "It would be irresponsible for me to claim that these four laws are an exhaustive framework for changing any human behavior, but I think they’re close.",
        "Every goal is doomed to fail if it goes against the grain of human nature.",
        "Your habits are shaped by the systems in your life.",
        "For this reason, we must begin the process of behavior change with awareness.",
        "* This process, known as Pointing-and-Calling , is a safety system designed to reduce mistakes.",
        "We need a “point-and- call” system for our personal lives.",
        "The goal is to simply notice what is actually going on.",
        "The process of behavior change always starts with awareness.",
        "The goal is to make the time and location so obvious that, with enough repetition, you get an urge to do the right thing at the right time, even if you can’t say why.",
        "Once you have mastered this basic structure, you can begin to create larger stacks by chaining small habits together.",
        "Bad habits are autocatalytic: the process feeds itself.",
        "Junk food, for example, drives our reward systems into a frenzy.",
        "A primary goal of food science is to create products that are more attractive to consumers.",
        "Throughout our discussion of the 2nd Law, our goal is to learn how to make our habits irresistible.",
        "Interestingly, the reward system that is activated in the brain when you receive a reward is the same system that is activated when you anticipate a reward.",
        "The family would keep a meticulous file system of the tournament history of every competitor the children faced.",
        "If your goal was to make it into space, then that room was about the best culture you could ask for."
      ]
    },
    "environment": {
      "count": 57,
      "quotes": [
        "You need to know how habits work and how to design them to your liking, so you can avoid the dangerous half of the blade.",
        "You learn to lock in on the cues that predict success and tune out everything else.",
        "The cue triggers your brain to initiate a behavior.",
        "The thoughts, feelings, and emotions of the observer are what transform a cue into a craving.",
        "Eliminate the cue and your habit will never start.",
        "This “habit loop” is continually scanning the environment, predicting what will happen next, trying out different responses, and learning from the results.",
        "Together, these four steps form a neurological feedback loop—cue, craving, response, reward; cue, craving, response, reward—that ultimately allows you to create automatic habits.",
        "The brain is continually scanning the environment, predicting what will happen next, trying out different responses, and learning from the results.",
        "The problem phase includes the cue and the craving, and it is when you realize that something needs to change.",
        "How to Create a Good Habit The 1st law (Cue): Make it obvious.",
        "How to Break a Bad Habit Inversion of the 1st law (Cue): Make it invisible.",
        "Any habit can be broken down into a feedback loop that involves four steps: cue, craving, response, and reward.",
        "With enough practice, you can pick up on the cues that predict certain outcomes without consciously thinking about it.",
        "This is one of the most surprising insights about our habits: you don’t need to be aware of the cue for a habit to begin.",
        "This method, which was created by BJ Fogg as part of his Tiny Habits program, can be used to design an obvious cue for nearly any habit.",
        "No matter how you use this strategy, the secret to creating a successful habit stack is selecting the right cue to kick things off.",
        "Your cue should also have the same frequency as your desired habit.",
        "Habit stacking works best when the cue is highly specific and immediately actionable.",
        "Because the amount of water in the environment was increased, behavior shifted naturally and without additional motivation.",
        "Your habits change depending on the room you are in and the cues in front of you.",
        "Environment is the invisible hand that shapes human behavior.",
        "Despite our unique personalities, certain behaviors tend to arise again and again under certain environmental conditions.",
        "Every habit is context dependent.",
        "Even bacteria have chemoreceptors —tiny sensory cells that allow them to detect toxic chemicals in their environment.",
        "Given that we are more dependent on vision than on any other sense, it should come as no surprise that visual cues are the greatest catalyst of our behavior.",
        "As a result, you can imagine how important it is to live and work in environments that are filled with productive cues and devoid of unproductive ones.",
        "Every habit is initiated by a cue, and we are more likely to notice cues that stand out.",
        "Unfortunately, the environments where we live and work often make it easy not to do certain actions because there is no obvious cue to trigger the behavior.",
        "When the cues that spark a habit are subtle or hidden, they are easy to ignore.",
        "If you want to make a habit a big part of your life, make the cue a big part of your environment.",
        "The most persistent behaviors usually have multiple cues.",
        "Environment design is powerful not only because it influences how we engage with the world but also because we rarely do it.",
        "Our behavior is not defined by the objects in the environment but by our relationship to them.",
        "You can train yourself to link a particular habit with a particular context.",
        "Over time, subjects began to associate the context of their bed with the action of sleeping, and it became easier to quickly fall asleep when they climbed in bed.",
        "The power of context also reveals an important strategy: habits can be easier to change in a new environment.",
        "It helps to escape the subtle triggers and cues that nudge you toward your current habits.",
        "It is easier to associate a new habit with a new context than to build a new habit in the face of competing cues.",
        "But when you step outside your normal environment, you leave your behavioral biases behind.",
        "You aren’t battling old environmental cues, which allows new habits to form without interruption.",
        "Whenever possible, avoid mixing the context of one habit with another.",
        "When you start mixing contexts, you’ll start mixing habits— and the easier ones will usually win out.",
        "Every habit is initiated by a cue.",
        "Make the cues of good habits obvious in your environment.",
        "It is easier to build new habits in a new environment because you are not fighting against old cues.",
        "Instead, Robins revealed that addictions could spontaneously dissolve if there was a radical change in the environment.",
        "When the context changed, so did the habit.",
        "Once a habit has been encoded, the urge to act follows whenever the environmental cues reappear.",
        "If you’re not careful about cues, you can cause the very behavior you want to stop.",
        "One of the most practical ways to eliminate a bad habit is to reduce exposure to the cue that causes it.",
        "Remove a single cue and the entire habit often fades away.",
        "Make the cues of your good habits obvious and the cues of your bad habits invisible.",
        "Make the cues of good habits obvious and visible.",
        "Remove the cues of your bad habits from your environment.",
        "The next time around (B), dopamine rises before taking action, immediately after a cue is recognized.",
        "This spike leads to a feeling of desire and a craving to take action whenever the cue is spotted.",
        "First, the cue is identified and dopamine rises as a craving builds."
      ]
    },
    "motivation": {
      "count": 24,
      "quotes": [
        "It often feels difficult to keep good habits going for more than a few days, even with sincere effort and the occasional burst of motivation.",
        "However, once your habits are established, they seem to stick around forever—especially the unwanted ones.",
        "Building habits in the present allows you to do more of what you want in the future.",
        "Cravings are the second step, and they are the motivational force behind every habit.",
        "Without some level of motivation or desire— without craving a change—we have no reason to act.",
        "Every craving is linked to a desire to change your internal state.",
        "Whether a response occurs depends on how motivated you are and how much friction is associated with the behavior.",
        "The solution phase includes the response and the reward, and it is when you take action and achieve the change you desire.",
        "Reward All behavior is driven by the desire to solve a problem.",
        "Whenever you want to change your behavior, you can simply ask yourself: 1 .",
        "If you waste time online, notice that you are spending your life in a way that you do not want to.",
        "If you want to cut back on your junk food habit but notice yourself grabbing another cookie, say out loud, “I’m about to eat this cookie, but I don’t need it.",
        "The key is to tie your desired behavior into something you already do each day.",
        "Let’s say you want to develop the habit of reading more each night.",
        "If you want to practice guitar more frequently, place your guitar stand in the middle of the living room.",
        "Adult herring gulls have a small red dot on their beak, and Tinbergen noticed that newly hatched chicks would peck this spot whenever they wanted food.",
        "If you want to increase the odds that a behavior will occur, then you need to make it attractive.",
        "And without desire, action stopped.",
        "Desire is the engine that drives behavior.",
        "We need to make our habits attractive because it is the expectation of a rewarding experience that motivates us to act in the first place.",
        "Temptation bundling works by linking an action you want to do with an action you need to do.",
        "Temptation bundling is one way to create a heightened version of any habit by connecting it with something you already want.",
        "The strategy is to pair an action you want to do with an action you need to do.",
        "Your culture sets your expectation for what is “normal.” Surround yourself with people who have the habits you want to have yourself."
      ]
    },
    "action": {
      "count": 81,
      "quotes": [
        "You’ll find wisdom and practical advice front and center as I explain the science of how to create and change your habits in a way that is easy to understand and apply.",
        "My contribution, I hope, is to find the ideas that matter most and connect them in a way that is highly actionable.",
        "How does a team of previously ordinary athletes transform into world champions with tiny changes that, at first glance, would seem to make a modest difference at best?",
        "Too often, we convince ourselves that massive success requires massive action.",
        "We often dismiss small changes because they don’t seem to matter very much in the moment.",
        "That said, it doesn’t matter how successful or unsuccessful you are right now.",
        "If your spending habits don’t change, it’s not going to end well.",
        "Habits are a double-edged sword.",
        "Bad habits can cut you down just as easily as good habits can build you up, which is why understanding the details is crucial.",
        "Being a little bit nicer in each interaction can result in a network of broad and strong connections over time.",
        "Breakthrough moments are often the result of many previous actions, which build up the potential required to unleash a major change.",
        "Similarly, habits often appear to make no difference until you cross a critical threshold and unlock a new level of performance.",
        "All the action happens at thirty-two degrees.",
        "It makes no sense to restrict your satisfaction to one scenario when there are many paths to success.",
        "Like all aspects of habit formation, this, too, is a double-edged sword.",
        "This brings us to an important question: If your beliefs and worldview play such an important role in your behavior, where do they come from in the first place?",
        "We do not change by snapping our fingers and deciding to be someone entirely new.",
        "This is one reason why meaningful change does not require radical change.",
        "Each time you practice the violin, you are a musician.",
        "It doesn’t matter if you cast a few votes for a bad behavior or an unproductive habit.",
        "Gradually, each cat learned to associate the action of pressing the lever with the reward of escaping the box and getting to the food.",
        "With practice, each cat made fewer errors and their actions became quicker and more automatic.",
        "And why does the brain bother building them at all?",
        "The brain is busy learning the most effective course of action.",
        "With practice, the useless movements fade away and the useful actions get reinforced.",
        "They make you think that you have to choose between building habits and attaining freedom.",
        "Habits do not restrict freedom.",
        "Without good financial habits, you will always be struggling for the next dollar.",
        "If you’re always being forced to make decisions about simple tasks—when should I work out, where do I go to write, when do I pay the bills—then you have less time for freedom.",
        "Conversely, when you have your habits dialed in and the basics of life are handled and done, your mind is free to focus on new challenges and master the next set of problems.",
        "The response is the actual habit you perform, which can take the form of a thought or an action.",
        "If a particular action requires more physical or mental effort than you are willing to expend, then you won’t do it.",
        "It sounds simple, but a habit can occur only if you are capable of doing it.",
        "Second, rewards teach us which actions are worth remembering in the future.",
        "Feelings of pleasure and disappointment are part of the feedback mechanism that helps your brain distinguish useful actions from useless ones.",
        "Make the behavior difficult and you won’t be able to do it.",
        "You have performed this simple habit so many times that it occurs without thinking.",
        "You proceed through all four stages in the fraction of a second.",
        "“I don’t like the way you look,” she said.",
        "You can notice an opportunity and take action without dedicating conscious attention to it.",
        "As habits form, your actions come under the direction of your automatic and nonconscious mind.",
        "Out on the platform, other employees are performing similar actions.",
        "We’re so used to doing what we’ve always done that we don’t stop to question whether it’s the right thing to do at all.",
        "One of our greatest challenges in changing habits is maintaining awareness of what we are actually doing.",
        "Observe your thoughts and actions without judgment or internal criticism.",
        "Don’t praise yourself for your successes.",
        "Say out loud the action that you are thinking of taking and what the outcome will be.",
        "You’re getting yourself to acknowledge the need for action—and that can make all the difference.",
        "Pointing-and-Calling raises your level of awareness from a nonconscious habit to a more conscious level by verbalizing your actions.",
        "The punch line is clear: people who make a specific plan for when and where they will perform a new habit are more likely to follow through.",
        "It is not always obvious when and where to take action.",
        "When the moment of action occurs, there is no need to make a decision.",
        "People are more likely to take action at those times because hope is usually higher.",
        "If we have hope, we have a reason to take action.",
        "When your dreams are vague, it’s easy to rationalize little exceptions all day long and never get around to the specific things you need to do to succeed.",
        "It’s a chain reaction of purchases.",
        "One of the best ways to build a new habit is to identify a current habit you already do each day and then stack your new behavior on top.",
        "It’s like you always have a game plan for which action should come next.",
        "Don’t ask yourself to do a habit when you’re likely to be occupied with something else.",
        "The truth, however, is that many of the actions we take each day are shaped not by purposeful drive and choice but by the most obvious option.",
        "For this reason, a small change in what you see can lead to a big shift in what you do .",
        "It’s easy not to practice the guitar when it’s tucked away in the closet.",
        "Their brains learned that sleeping—not browsing on their phones, not watching television, not staring at the clock—was the only action that happened in that room.",
        "It’s easier to practice self-restraint when you don’t have to use it very often.",
        "It’s a downward spiral, a runaway train of bad habits.",
        "This practice is an inversion of the 1st Law of Behavior Change.",
        "Eventually, he created a beak with three large red dots on it.",
        "Advertisements are created with a combination of ideal lighting, professional makeup, and Photoshopped edits—even the model doesn’t look like the person in the final image.",
        "We begin by examining a biological signature that all habits share— the dopamine spike.",
        "(Humans are not so different: the average slot machine player will spin the wheel six hundred times per hour.) Habits are a dopamine-driven feedback loop.",
        "Every behavior that is highly habit-forming—taking drugs, eating junk food, playing video games, browsing social media—is associated with higher levels of dopamine.",
        "When it comes to habits, the key takeaway is this: dopamine is released not only when you experience pleasure, but also when you anticipate it.",
        "It is the anticipation of a reward—not the fulfillment of it—that gets us to take action.",
        "Once a habit is learned, dopamine will not rise when a reward is experienced because you already expect the reward.",
        "They are often referred to as “hedonic hot spots” and are distributed like tiny islands throughout the brain.",
        "Every action is taken because of the anticipation that precedes it.",
        "You’re more likely to find a behavior attractive if you get to do one of your favorite things at the same time.",
        "Habits are a dopamine-driven feedback loop.",
        "We don’t choose our earliest habits, we imitate them.",
        "When your wife has a habit of double-checking that the door is locked before going to bed, you pick it up as well.",
        "We soak up the qualities and practices of those around us."
      ]
    },
    "results": {
      "count": 30,
      "quotes": [
        "With the same habits, you’ll end up with the same results.",
        "Maybe there are people who can achieve incredible success overnight.",
        "What matters is whether your habits are putting you on the path toward success.",
        "You should be far more concerned with your current trajectory than with your current results.",
        "Your outcomes are a lagging measure of your habits.",
        "Time magnifies the margin between success and failure.",
        "Accomplishing one extra task is a small feat on any given day, but it counts for a lot over an entire career.",
        "Riots, protests, and mass movements are rarely the result of a single event.",
        "People make a few small changes, fail to see a tangible result, and decide to stop.",
        "Complaining about not achieving success despite working hard is like complaining about an ice cube not melting when you heated it from twenty-five to thirty-one degrees.",
        "When you finally break through the Plateau of Latent Potential, people will call it an overnight success.",
        "This can result in a “valley of disappointment” where people feel discouraged after putting in weeks or months of hard work without experiencing any results.",
        "We think we need to change our results, but the results are not the problem.",
        "When you solve problems at the results level, you only solve them temporarily.",
        "Just as atoms are the building blocks of molecules, atomic habits are the building blocks of remarkable results.",
        "This level is concerned with changing your results: losing weight, publishing a book, winning a championship.",
        "This leads us to outcome-based habits.",
        "Each habit not only gets results but also teaches you something far more important: to trust yourself.",
        "If you keep casting the same votes you’ve always cast, you’re going to get the same results you’ve always had.",
        "It’s not about achieving external measures of success like earning more money, losing weight, or reducing stress.",
        "Habits can help you achieve all of these things, but fundamentally they are not about having something.",
        "As a result, your brain is always working to preserve your conscious attention for whatever task is most essential.",
        "The result is a change in the pattern of distribution of blood in the face.",
        "Generally speaking, good habits will have net positive outcomes.",
        "Bad habits have net negative outcomes.",
        "Consider when you are most likely to be successful.",
        "They made similar adjustments—and saw similar results—with the food in the cafeteria.",
        "Shaming obese people with weight-loss presentations can make them feel stressed, and as a result many people return to their favorite coping strategy: overeating.",
        "Laszlo successfully courted Klara, and within a few years, the Polgars were parents to three young girls: Susan, Sofia, and Judit.",
        "We copy the way our parents handle arguments, the way our peers flirt with one another, the way our coworkers get results."
      ]
    },
    "change": {
      "count": 36,
      "quotes": [
        "Unfortunately, the slow pace of transformation also makes it easy to let a bad habit slide.",
        "The impact created by a change in your habits is similar to the effect of shifting the route of an airplane by just a few degrees.",
        "Learning one new idea won’t make you a genius, but a commitment to lifelong learning can be transformative.",
        "Furthermore, each book you read not only teaches you something new but also opens up different ways of thinking about old ideas.",
        "A one-degree shift, seemingly no different from the temperature increases before it, has unlocked a huge change.",
        "Change can take years—before it happens all at once.",
        "Small changes often appear to make no difference until you cross a critical threshold.",
        "Changing our habits is challenging for two reasons: (1) we try to change the wrong thing and (2) we try to change our habits in the wrong way.",
        "Our first mistake is that we try to change the wrong thing.",
        "To understand what I mean, consider that there are three levels at which change can occur.",
        "All levels of change are useful in their own way.",
        "The problem is the direction of change.",
        "They are hoping their behavior will change while carrying around the same beliefs.",
        "You can imagine many ways to try to get more people to vote in a democracy, but such behavior change would never get off the ground in a dictatorship.",
        "It’s hard to change your habits if you never change the underlying beliefs that led to your past behavior.",
        "We change bit by bit, day by day, habit by habit.",
        "And if a change is meaningful, it actually is big.",
        "When the votes mount up and the evidence begins to change, the story you tell yourself begins to change as well.",
        "If nothing changes, nothing is going to change.",
        "Otherwise, your quest for change is like a boat without a rudder.",
        "You have the power to change your beliefs about yourself.",
        "This is the feedback loop behind all human behavior: try, fail, learn, try differently.",
        "What you crave is not the habit itself but the change in state it delivers.",
        "As you will soon see, the Four Laws of Behavior Change apply to nearly every field, from sports to politics, art to medicine, comedy to management.",
        "There is no need for completely different strategies for each habit.",
        "As you create your Habits Scorecard, there is no need to change anything at first.",
        "You need to be aware of your habits before you can change them.",
        "HABIT STACKING: A SIMPLE PLAN TO OVERHAUL YOUR HABITS The French philosopher Denis Diderot lived nearly his entire life in poverty, but that all changed one day in 1765.",
        "The 1st Law of Behavior Change is to make it obvious.",
        "When their energy use was obvious and easy to track, people changed their behavior.",
        "Consider how many different ways a smoker could be prompted to pull out a cigarette: driving in the car, seeing a friend smoke, feeling stressed at work, and so on.",
        "Different people can have different memories—and thus different habits—associated with the same place.",
        "This is one reason behavior change techniques can backfire.",
        "I’m often surprised by how effective simple changes like these can be.",
        "These insights reveal the importance of the 2nd Law of Behavior Change.",
        "Each group offers an opportunity to leverage the 2nd Law of Behavior Change and make our habits more attractive."
      ]
    },
    "time": {
      "count": 20,
      "quotes": [
        "It was a new beginning, and it was the place where I would discover the surprising power of small habits for the first time.",
        "We all deal with setbacks but in the long run, the quality of our lives often depends on the quality of our habits.",
        "It was a gradual evolution, a long series of small wins and tiny breakthroughs.",
        "Human behavior is always changing: situation to situation, moment to moment, second to second.",
        "Good habits make time your ally.",
        "Bad habits make time your enemy.",
        "Two tectonic plates can grind against one another for millions of years, the tension slowly building all the while.",
        "And the task of building a good habit is like cultivating a delicate flower one day at a time.",
        "Over the long run, however, the real reason you fail to stick with habits is that your self-image gets in the way.",
        "This four-step pattern is the backbone of every habit, and your brain runs through these steps in the same order each time.",
        "For this exercise, categorize your habits by how they will benefit you in the long run.",
        "The simple way to apply this strategy to your habits is to fill out this sentence: I will [BEHAVIOR] at [TIME] in [LOCATION].",
        "Give your habits a time and a space to live in the world.",
        "Rather than pairing your new habit with a particular time and location, you pair it with a current habit.",
        "This allows you to take advantage of the natural momentum that comes from one behavior leading into the next—a positive version of the Diderot Effect.",
        "Unlike an implementation intention, which specifically states the time and location for a given behavior, habit stacking implicitly has the time and location built into it.",
        "Creating an implementation intention is a strategy you can use to pair a new habit with a specific time and location.",
        "The implementation intention formula is: I will [BEHAVIOR] at [TIME] in [LOCATION].",
        "He was, in the words of one fan, “ eliminating obesity one Netflix binge at a time.” He was also employing temptation bundling to make his exercise habit more attractive.",
        "Often, you follow the habits of your culture without thinking, without questioning, and sometimes without remembering."
      ]
    },
    "success": {
      "count": 2,
      "quotes": [
        "What starts as a small win or a minor setback accumulates into something much more.",
        "Prove it to yourself with small wins."
      ]
    },
    "small_steps": {
      "count": 10,
      "quotes": [
        "Tiny battles like these are the ones that will define your future self.",
        "All big things come from small beginnings.",
        "The seed of every habit is a single, tiny decision.",
        "But atomic habits are not just any old habits, however small.",
        "They are both small and mighty.",
        "The ultimate purpose of habits is to solve the problems of life with as little energy and effort as possible.",
        "The labels “good habit” and “bad habit” are slightly inaccurate.",
        "Sharks can detect small amounts of electricity and vibrations in the water caused by nearby fish.",
        "However, when the tiny gulls saw the red spot on the cardboard beak, they pecked away just as if it were attached to their own mother.",
        "When astronaut Mike Massimino was a graduate student at MIT, he took a small robotics class."
      ]
    },
    "wisdom": {
      "count": 129,
      "quotes": [
        "I believe it is one of the first models of human behavior to accurately account for both the influence of external stimuli and internal emotions on our habits.",
        "It’s about the fundamentals of human behavior.",
        "The ideas you can build a business around, build a family around, build a life around.",
        "As long as human behavior is involved, this book will be your guide.",
        "A single decision is easy to dismiss.",
        "Your net worth is a lagging measure of your financial habits.",
        "Your weight is a lagging measure of your eating habits.",
        "Your knowledge is a lagging measure of your learning habits.",
        "Your clutter is a lagging measure of your cleaning habits.",
        "The more tasks you can handle without thinking, the more your brain is free to focus on other areas.",
        "People reflect your behavior back to you.",
        "The more you think of yourself as worthless, stupid, or ugly, the more you condition yourself to interpret life that way.",
        "Once you fall into the habit of seeing people as angry, unjust, or selfish, you see those kind of people everywhere.",
        "This is one of the core reasons why it is so hard to build habits that last.",
        "But in order to make a meaningful difference, habits need to persist long enough to break through this plateau—what I call the Plateau of Latent Potential .",
        "The task of breaking a bad habit is like uprooting a powerful oak within us.",
        "But what determines whether we stick with a habit long enough to survive the Plateau of Latent Potential and break through to the other side?",
        "Habits are like the atoms of our lives.",
        "Despite our best intentions, unhealthy habits like eating junk food, watching too much television, procrastinating, and smoking can feel impossible to break.",
        "Most of the habits you build are associated with this level.",
        "Voting is a behavior that is impossible under a certain set of beliefs.",
        "Behavior that is incongruent with the self will not last.",
        "If you’re proud of how your hair looks, you’ll develop all sorts of habits to care for and maintain it.",
        "Once your pride gets involved, you’ll fight tooth and nail to maintain your habits.",
        "“I’m terrible with directions.” “I’m not a morning person.” “I’m bad at remembering people’s names.” “I’m always late.” “I’m not good with technology.” “I’m horrible at math.” .",
        "You find whatever way you can to avoid contradicting yourself.",
        "On any given day, you may struggle with your habits because you’re too busy or too tired or too overwhelmed or hundreds of other reasons.",
        "Of course, it works the opposite way, too.",
        "And this brings us to the deeper purpose of this book and the real reason habits matter.",
        "Thorndike was interested in studying the behavior of animals, and he started by working with cats.",
        "Thorndike tracked the behavior of each cat across many trials.",
        "It also provides answers to some fundamental questions like: What are habits?",
        "Habits are mental shortcuts learned from experience.",
        "Habit formation is incredibly useful because the conscious mind is the bottleneck of the brain.",
        "This is precisely what happens when a habit is formed.",
        "Habits reduce cognitive load and free up mental capacity, so you can allocate your attention to other tasks.",
        "Despite their efficiency, some people still wonder about the benefits of habits.",
        "Without good health habits, you will always seem to be short on energy.",
        "Without good learning habits, you will always feel like you’re behind the curve.",
        "It’s only by making the fundamentals of life easier that you can create the mental space needed for free thinking and creativity.",
        "Rewards close the feedback loop and complete the habit cycle.",
        "Without the first three steps, a behavior will not occur.",
        "This cycle is known as the habit loop.",
        "Either way, the purpose of every habit is to solve the problems you face.",
        "You can think of each law as a lever that influences human behavior.",
        "When the levers are in the right positions, creating good habits is effortless.",
        "The 3rd law (Response): Make it easy.",
        "We can invert these laws to learn how to break a bad habit.",
        "The key to creating good habits and breaking bad ones is to understand these fundamental laws and how to alter them to your specifications.",
        "They are (1) make it obvious, (2) make it attractive, (3) make it easy, and (4) make it satisfying.",
        "When major arteries are obstructed, the body focuses on sending blood to critical organs and away from peripheral locations near the surface of the skin.",
        "This is what makes habits useful.",
        "Even though she was now working with adults, her old habits would kick in and she kept asking coworkers if they had washed their hands after going to the bathroom.",
        "This can be more challenging than it sounds because once a habit is firmly rooted in your life, it is mostly nonconscious and automatic.",
        "If you ever find yourself riding a train in Tokyo, you’ll notice that the conductors have a peculiar habit.",
        "This helps explain why the consequences of bad habits can sneak up on us.",
        "Once you have a full list, look at each behavior, and ask yourself, “Is this a good habit, a bad habit, or a neutral habit?” If it is a good habit, write “+” next to it.",
        "If it is a bad habit, write “–”.",
        "If it is a neutral habit, write “=”.",
        "For someone who is trying to lose weight, eating a bagel with peanut butter every morning might be a bad habit.",
        "For someone who is trying to bulk up and add muscle, the same behavior might be a good habit.",
        "* Scoring your habits can be a bit more complex for another reason as well.",
        "There are no good habits or bad habits.",
        "There are only effective habits.",
        "Smoking a cigarette may reduce stress right now (that’s how it’s serving you), but it’s not a healthy long-term behavior.",
        "The first step to changing bad habits is to be on the lookout for them.",
        "We tell ourselves, “I’m going to eat healthier” or “I’m going to write more,” but we never say when and where these habits are going to happen.",
        "If you aren’t sure when to start your habit, try the first day of the week, month, or year.",
        "My favorite approach is one I learned from Stanford professor BJ Fogg and it is a strategy I refer to as habit stacking .",
        "Diderot’s behavior is not uncommon.",
        "The Diderot Effect states that obtaining a new possession often creates a spiral of consumption that leads to additional purchases.",
        "Many human behaviors follow this cycle.",
        "No behavior happens in isolation.",
        "When it comes to building new habits, you can use the connectedness of behavior to your advantage.",
        "This is called habit stacking .",
        "Habit stacking is a special form of an implementation intention.",
        "* The habit stacking formula is: “After [CURRENT HABIT], I will [NEW HABIT].” For example: Meditation.",
        "Or, consider this habit stack in the evening: 1 .",
        "Overall, habit stacking allows you to create a set of simple rules that guide your future behavior.",
        "One way to find the right trigger for your habit stack is by brainstorming a list of your current habits.",
        "Alternatively, you can create a list with two columns.",
        "Armed with these two lists, you can begin searching for the best place to layer your new habit into your lifestyle.",
        "Habit stacking is a strategy you can use to pair a new habit with a current habit.",
        "The habit stacking formula is: After [CURRENT HABIT], I will [NEW HABIT].",
        "But we also have other ways of sensing stimuli.",
        "The most powerful of all human sensory abilities, however, is vision.",
        "Others had the electrical meter upstairs in the main hallway.",
        "As you may guess, the homes with the meters located in the main hallway used less electricity.",
        "It’s easy not to read a book when the bookshelf is in the corner of the guest room.",
        "It’s easy not to take your vitamins when they are out of sight in the pantry.",
        "The same strategy can be employed for good habits.",
        "Most people live in a world others have created for them.",
        "We mentally assign our habits to the locations in which they occur: the home, the office, the gym.",
        "It can be hard to study in the living room without getting distracted if that’s where you always play video games.",
        "Move to a bigger room, a rooftop patio, or a building with expansive architecture.",
        "Create a separate space for work, study, exercise, entertainment, and cooking.",
        "You can use your phone for all sorts of tasks, which makes it a powerful device.",
        "Every habit should have a home.",
        "Focus comes automatically when you are sitting at your work desk.",
        "The Vietnam studies ran counter to many of our cultural beliefs about bad habits because it challenged the conventional association of unhealthy behavior as a moral weakness.",
        "This counterintuitive idea makes even more sense once you understand what happens when a habit is formed in the brain.",
        "A habit that has been encoded in the mind is ready to be used whenever the relevant situation arises.",
        "Here’s the punch line: You can break a habit, but you’re unlikely to forget it.",
        "Once the mental grooves of habit have been carved into your brain, they are nearly impossible to remove entirely—even if they go unused for quite a while.",
        "And that means that simply resisting temptation is an ineffective strategy.",
        "A more reliable approach is to cut bad habits off at the source.",
        "Once a habit is formed, it is unlikely to be forgotten.",
        "HOW TO CREATE A GOOD HABIT The 1st Law : Make It Obvious 1.1: Fill out the Habits Scorecard.",
        "When the parents had flown away, he went over to the nest and offered these dummy beaks to the chicks.",
        "Tinbergen and his colleagues discovered similar behavior in other animals.",
        "It’s like the brain of each animal is preloaded with certain rules for behavior, and when it comes across an exaggerated version of that rule, it lights up like a Christmas tree.",
        "Nearly every food in a bag, box, or jar has been enhanced in some way, if only with additional flavoring.",
        "The same can be said for our most basic habitual behaviors like eating food, drinking water, having sex, and interacting socially.",
        "Every Thursday, the company would air three shows created by screenwriter Shonda Rhimes— Grey’s Anatomy , Scandal , and How to Get Away with Murder .",
        "Temptation bundling is one way to apply a psychology theory known as Premack’s Principle.",
        "The habit stacking + temptation bundling formula is: 1 .",
        "Engineering a truly irresistible habit is a hard task, but this simple strategy can be employed to make nearly any habit more attractive than it would be otherwise.",
        "Temptation bundling is one way to make your habits more attractive.",
        "I 9 The Role of Family and Friends in Shaping Your Habits N 1965 , a Hungarian man named Laszlo Polgar wrote a series of strange letters to a woman named Klara.",
        "And as we are about to see, whatever habits are normal in your culture are among the most attractive behaviors you’ll find.",
        "And this ancient preference exerts a powerful influence on our modern behavior.",
        "You’re always keeping them in mind, even if they are at the not top of your mind.",
        "We imitate the habits of three groups in particular: 1 .",
        "Imitating the Close Proximity has a powerful effect on our behavior.",
        "We pick up habits from the people around us.",
        "I find that I often imitate the behavior of those around me without realizing it.",
        "As a general rule, the closer we are to someone, the more likely we are to imitate some of their habits.",
        "If you are surrounded by fit people, you’re more likely to consider working out to be a common habit.",
        "To make your habits even more attractive, you can take this strategy one step further."
      ]
    }
  }
}